Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/atdf/PIC32CZ2051CA80144.atdf
      <value-group name="MCRAMC_CTRLA__SWRST">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Reset the MCRAMC. A software-triggered hardware reset of the MCRAMC user interface is performed." value="1"/>
      </value-group>
      <value-group name="MCRAMC_CTRLA__ENABLE">
        <value name="0" caption="ECC decoding is disabled." value="0"/>
        <value name="1" caption="ECC decoding is enabled." value="1"/>
      </value-group>
      <value-group name="MCRAMC_FLTCTRL__FLTEN">
        <value name="0" caption="Disables fault injection." value="0"/>
        <value name="1" caption="Enables fault injection at FLTADR address offset as selected by FLTMD and FLTxPTR." value="1"/>
      </value-group>
      <value-group name="MCRAMC_ERRCSYN__ERCSYN">
        <value name="0" caption="Not a Single bit error." value="0"/>
        <value name="1" caption="Single bit error." value="1"/>
      </value-group>
      <value-group name="MCRAMC_ERRCSYN__ERR2">
        <value name="0" caption="Not a Double bit error." value="0"/>
        <value name="1" caption="Double bit error." value="1"/>
      </value-group>
    </module>
    <module name="MLB" id="03809" name2="mlb_3pin_sib_v1" version="1a0" caption="Media Local Bus">
      <register-group name="MLB" caption="Media Local Bus">
        <register name="MLB_CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="MLB Wrapper Control Register">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="MediaLB Enable (ON) bit" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby" mask="0x40"/>
        </register>
        <register name="INTENCLR" offset="0x10" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear Register">
          <bitfield name="INTMLB" caption="MLB General Interrupt Enable Clear" mask="0x1"/>
          <bitfield name="INT0AHB" caption="AHB Interrupt 0 Enable Clear" mask="0x2"/>
          <bitfield name="INT1AHB" caption="AHB Interrupt 1 Enable Clear" mask="0x4"/>
        </register>
        <register name="INTENSET" offset="0x14" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set Register">
          <bitfield name="INTMLB" caption="MLB General Interrupt Enable Set" mask="0x1"/>
          <bitfield name="INT0AHB" caption="AHB Interrupt 0 Enable Set" mask="0x2"/>
          <bitfield name="INT1AHB" caption="AHB Interrupt 1 Enable Set" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Status and Clear Register">
          <bitfield name="INTMLB" caption="MLB General Interrupt Flag" mask="0x1"/>
          <bitfield name="INT0AHB" caption="AHB Interrupt 0 Flag" mask="0x2"/>
          <bitfield name="INT1AHB" caption="AHB Interrupt 1 Flag" mask="0x4"/>
        </register>
        <register name="DBGCTRL" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Debug Control Register">
          <bitfield name="DBGRUN" caption="Debug Run Enable" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x20" rw="R" size="4" initval="0x00000000" caption="SYNCBUSY Register">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Module Enable Synchronization Busy" mask="0x2"/>
        </register>
        <register name="MLBC0" offset="0x400" rw="RW" size="4" initval="0x00000000" caption="MediaLB Control 0 Register">
          <bitfield name="MLBEN" caption="MediaLB enable" mask="0x1"/>
          <bitfield name="MLBCLK" caption="MediaLB clock speed select" mask="0x1C" values="MLBC0__MLBCLK"/>
          <bitfield name="MLBPEN" caption="MediaLB 6-pin enable." mask="0x20"/>
          <bitfield name="MLBLK" caption="MediaLB lock status (read-only)" mask="0x80"/>
          <bitfield name="ASYRETRY" caption="Asynchronous Tx packet retry" mask="0x1000"/>
          <bitfield name="CTLRETRY" caption="Control Tx packet retry" mask="0x4000"/>
          <bitfield name="FCNT" caption="Number of frames per sub-buffer (synchronous channels)" mask="0x38000"/>
        </register>
        <register name="MS0" offset="0x40C" rw="RW" size="4" initval="0x00000000" caption="MediaLB Channel Status 0 Register">
          <bitfield name="MCS" caption="MediaLB channel status (for channels 31 to 0)" mask="0xFFFFFFFF"/>
        </register>
        <register name="MS1" offset="0x414" rw="RW" size="4" initval="0x00000000" caption="MediaLB Channel Status 1 Register">
          <bitfield name="MCS" caption="MediaLB channel status (for channels 63 to 32)" mask="0xFFFFFFFF"/>
        </register>
        <register name="MSS" offset="0x420" rw="RW" size="4" initval="0x00000000" caption="MediaLB System Status Register">
          <bitfield name="RSTSYSCMD" caption="Reset system command detected" mask="0x1"/>
          <bitfield name="LKSYSCMD" caption="Network lock system command detected" mask="0x2"/>
          <bitfield name="ULKSYSCMD" caption="Network unlock system command detected" mask="0x4"/>
          <bitfield name="CSSYSCMD" caption="Channel scan system command detected" mask="0x8"/>
          <bitfield name="SWSYSCMD" caption="Software system command detected" mask="0x10"/>
          <bitfield name="SERVREQ" caption="Service request enable" mask="0x20"/>
        </register>
        <register name="MSD" offset="0x424" rw="R" size="4" initval="0x00000000" caption="MediaLB System Data Register (Read-only)">
          <bitfield name="SD0" caption="System data (byte 0) - LSB" mask="0xFF"/>
          <bitfield name="SD1" caption="System data (byte 1)" mask="0xFF00"/>
          <bitfield name="SD2" caption="System data (byte 2)" mask="0xFF0000"/>
          <bitfield name="SD3" caption="System data (byte 3) - MSB" mask="0xFF000000"/>
        </register>
        <register name="MIEN" offset="0x42C" rw="RW" size="4" initval="0x00000000" caption="MediaLB Interrupt Enable Register">
          <bitfield name="ISOC_PE" caption="Isochronous Rx protocol error enable" mask="0x1"/>
          <bitfield name="ISOC_BUFO" caption="Isochronous Rx buffer overflow enable" mask="0x2"/>
          <bitfield name="SYNC_PE" caption="Synchronous protocol error enable" mask="0x10000"/>
          <bitfield name="ARX_DONE" caption="Asynchronous Rx packet done enable" mask="0x20000"/>
          <bitfield name="ARX_PE" caption="Asynchronous Rx protocol error enable" mask="0x40000"/>
          <bitfield name="ARX_BREAK" caption="Asynchronous Rx break enable" mask="0x80000"/>
          <bitfield name="ATX_DONE" caption="Asynchronous Tx packet done enable" mask="0x100000"/>
          <bitfield name="ATX_PE" caption="Asynchronous Tx protocol error enable" mask="0x200000"/>
          <bitfield name="ATX_BREAK" caption="Asynchronous Tx break enable" mask="0x400000"/>
          <bitfield name="CRX_DONE" caption="Control Rx packet done enable" mask="0x1000000"/>
          <bitfield name="CRX_PE" caption="Control Rx protocol error enable" mask="0x2000000"/>
          <bitfield name="CRX_BREAK" caption="Control Rx break enable" mask="0x4000000"/>
          <bitfield name="CTX_DONE" caption="Control Tx packet done enable" mask="0x8000000"/>
          <bitfield name="CTX_PE" caption="Control Tx protocol error enable" mask="0x10000000"/>
          <bitfield name="CTX_BREAK" caption="Control Tx break enable" mask="0x20000000"/>
        </register>
        <register name="MLBC1" offset="0x43C" rw="RW" size="4" initval="0x00000000" caption="MediaLB Control 1 Register">
          <bitfield name="LOCK" caption="MediaLB lock error status" mask="0x40"/>
          <bitfield name="CLKM" caption="MediaLB clock missing status" mask="0x80"/>
          <bitfield name="NDA" caption="Node device address" mask="0xFF00"/>
        </register>
        <register name="HCTL" offset="0x480" rw="RW" size="4" initval="0x00000000" caption="HBI Control Register">
          <bitfield name="RST0" caption="AGU0 software reset: 1 = reset active, 0 = reset inactive" mask="0x1"/>
          <bitfield name="RST1" caption="AGU1 software reset: 1 = reset active, 0 = reset inactive" mask="0x2"/>
          <bitfield name="EN" caption="HBI enable: 1 = enabled, 0 = disabled" mask="0x8000"/>
        </register>
